function Random(start, end) {
    let num = (Math.random() * (end - start) + start).toString();
    return parseInt(num, 10);
}
function SetBarrage(text) {
    var barrage = document.createElement('span');
    barrage.className = "content-barrage-single";
    barrage.innerText = text;
    document.getElementById('content-barrage').appendChild(barrage);
    const randomTime = Random(10, 15);
    const randomTop = Random(0, 100);
    barrage.style.top = randomTop + "%";
    barrage.style.animation = "barrage " + randomTime + "s linear";
    setTimeout(() => {
        document.getElementById('content-barrage').removeChild(barrage)
    }, randomTime * 1000);
}
window.onload = function () {
    let danmuPool = [
        '妈妈，在你生日来临之际，您最爱的儿子有许多许多的话想对您说。因为路途遥远平时很少回家，只好把千言万语写在这里，带着女儿的祝福飘进“妈妈“的梦里！',
        '我喜欢春的满目绿色，喜欢夏的骄阳似火，喜欢秋的枫叶飘零，喜欢冬的白雪皑皑。但我更喜欢每年的今天为你送上我真挚的祝福：生日快乐，幸福永久！',
        '在这无比温馨的时刻，遥向你敬上一杯酒，连同我的衷心祝福，礼不贵，情珍贵。祝福你拥有一个甜蜜温馨、快快乐乐的生日，快乐永存在。',
        '生日快乐，妈妈，真希望有语言能表达我们的谢意，感谢你每日操持家务，给予我们的帮助。愿你在未来的岁月中永远快乐健康!',
        '今天你的生日，送你棵卷心菜，要轻轻的剥开哦，因为里面包裹着我的殷殷祝福：愿你岁岁渐红，好运当头；身体棒棒，万寿无疆！',
        '风是透明的，雨是滴答的，云是流动的，歌是自由的，爱是用心的，恋是疯狂的，天是永恒的，你是难忘的。真心祝福你——生日快乐！',
        '妈妈，我想您，不仅是在今天，今天是您的生日，虽然我在外地，但我的心已经飞回您的身边，妈妈的爱!',
        '送你一碗长寿面，福气长长不会断；送你一个大蛋糕，幸福甜甜品不完；送你一捧鲜花，美丽光鲜人人羡；送你一份小祝福，大大的幸福享不完。生日快乐！',
        '福如东海，寿比南山！祝福亲爱的妈妈生日快乐身体康健！岁岁年年！',
        '今天太阳为你升起，鸟儿为你歌唱，花朵为你绽放，我为你送来祝福，愿你成长快乐，生日快乐，家人快乐，工作快乐，天天快乐，时时快乐，刻刻快乐。',
        '希望我是妈妈贴心小棉袄，也能成为保护妈妈的铠甲，祝妈妈生日快乐，身体健康，实现愿望，愿岁月温柔待她。',
        '妈妈生日快乐！世界上最最最最爱我的人，我也永远最最最爱您！祝您身体健康，平平安安快快乐乐，拥有好睡眠。',
        '愿你岁岁年年与快乐相伴，日日夜夜与好运相连，朝朝暮暮和爱人缠绵，时时刻刻和幸福相见，分分秒秒和如意牵手，祝你生日快乐，万事如意，笑口常开，心想事成。',
        '生生世世喜无边，日日年年福绕前。快马一鞭传佳讯，乐舞欢歌伴梦眠。',
        '总以为我会孤单一辈子，总以为幸福离我遥不可及，自从遇到你后，我才明白我是那么的幸运，那么的甜蜜，今天是你的生日，祝亲爱的生日快乐！永远健康平安！',
        '回想往事，浮现您幽默的话语，率真的性情。您是无边无际的大海，包容着我们的过错，您是涓涓细流，滋润着我们的心田，恭祝生日快乐！',
        '让世界上一切的欢乐都融和在我的歌中，来庆贺你的生日这一季的花开得格外娇艳，你可知，那是因为我用情感在浇灌只等你的生日赠与你，愿你喜欢。',
        '忙碌的日子让彼此疏远，但知心的朋友一生难忘，莫让时间冲淡友谊的酒，莫让距离拉开思念的手，当时光流逝，物换星移，我依然记着你。生日愉快！',
        '你是大树，为我遮蔽风风雨雨；你是太阳，为我的生活带来光明。亲爱的宝贝，祝你事业有成步步高升。生日快乐！',
        '在这个与众不同的日子里，我把誓言一生一世戴在你的手指上，纵然一生平平淡淡，同尝甘苦，我愿永远为你挡风遮雨共度朝朝暮暮。生日快乐！',
        '祝你生日快乐，你的善良使这个世界变得更加美好，愿这完全属于你的一天带给你快乐，愿未来的日子锦上添花！',
        '难忘是你我纯洁的友情，可贵是不变的真情，很高兴能认识你，献上我最爱的水晶，祝你生日快乐！',
        '~~~~~~~生日快乐~~~~~~~',
        '~~~~~~~生日快乐~~~~~~~',
        '~~~~~~~生日快乐~~~~~~~',
        '~~~~~~~生日快乐~~~~~~~',
        '~~~~~~~生日快乐~~~~~~~',
        '~~~~~~~生日快乐~~~~~~~',
        '~~~~~~~生日快乐~~~~~~~',
        '~~~~~~~生日快乐~~~~~~~',
        '阳光虽然灿烂，但不及你笑容甜甜；月光虽然皎洁，但不如你的烛光亲切；今天日光、月光、星光、灯光、烛光都为你点亮，只为祝愿你生日快乐幸福长。',
        '不会说甜话,都是复制来的...'
    ];
    let length = danmuPool.length;
    console.log(length);

    let index = 0;
    setInterval(() => {
        index = this.Random(0, length);
        this.SetBarrage(danmuPool[index]);
        console.log(danmuPool[index]);
    }, 2000);
}